Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateExplicitCrease Property
 Cannot create a new split line based on the picked support.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateExplicitCrease { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateExplicitCrease As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateExplicitCrease {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace